# ¬ переменной my_vector сохранен вектор с пропущенными значени€ми. ¬ам нужно создать новый вектор 
# fixed_vector, в котором все пропущенные значени€ вектора my_vector будут заменены на среднее 
# значение по имеющимс€ наблюдени€м. ѕри этом исходный вектор оставьте без изменений!

# Sample Input 1:
  # 23 10 16 19 23 22 16 21 24 20 22 21 19 25 22 14 22 14 16 15 NA 24 NA NA NA 23 15 21 24 NA NA 
  # NA 18 21 18 NA 17 20 17 NA
# Sample Output 1:
  # 23.0 10.0 16.0 19.0 23.0 22.0 16.0 21.0 24.0 20.0 22.0 21.0 19.0 25.0 22.0 14.0 22.0 14.0 16.0 
  # 15.0 19.4194 24.0 19.4194 19.4194 19.4194 23.0 15.0 21.0 24.0 19.4194 19.4194 19.4194 18.0 21.0 
  # 18.0 19.4194 17.0 20.0 17.0 19.4194

fixed_vector <- replace(my_vector, is.na(my_vector), mean(my_vector, na.rm = T))
