# По предложенной выборке постройте гистограмму, используя интервалы:
# [15, 15.75], (15.75, 16.5], (16.5, 17.25], (17.25, 18.0], (18.0, 18.75], (18.75, 19.5], (19.5, 20.25], (20.25, 21.0]
# Найдите относительные частоты попадания элементов выборки в данные интервалы.
# 
# Формат ответа: относительные частоты с точностью до третьего знака после запятой через запятую с пробелом
# Sample Input:
#   18.55, 16.5, 18.09, 19.17, 17.09, 18.16, 16.09, 18.79, 17.44, 17.92
# Sample Output:
#   0.000, 0.200, 0.100, 0.200, 0.300, 0.200, 0.000, 0.000


v <- c(17.47, 17.03, 18.1, 19.01, 18.13, 18.37, 18.67, 19.51, 18.4, 18.62, 17.24, 18.09, 19.63,
       17.58, 18.75, 17.19, 18.4, 17.9, 17.96, 17.23, 19.07, 17.22, 17.83, 18.81, 16.94, 16.63,
       18.13, 19.55, 20.33, 17.95, 19.62, 18.05, 19.14, 17.97, 19.09, 17.43, 16.54, 17.02, 16.14,
       17.36)


hist_maker <- function(x){
  h <- hist(x, breaks = c(15, 15.75, 16.5, 17.25, 18.0, 18.75, 19.5, 20.25, 21.0))
  return(cat(h$counts/length(v), sep=', '))
}


